app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"
---
  def index
    @listings = Listing.all