app/controllers/listings_controller.rb

  def seller
    @listings = Listing.where(user: current_user).order("created_at DESC")
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 2  ORDER BY created_at DESC

  def index
    @listings = Listing.all.order("created_at DESC")
---
SELECT "listings".* FROM "listings"  ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test Listing"], ["description", "This is jsut a test."], ["price", 1.0], ["created_at", "2015-06-28 21:21:14.967908"], ["updated_at", "2015-06-28 21:21:14.967908"]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_size" = ?, "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["image_file_size", 115714], ["image_updated_at", "2015-07-02 01:15:01.337569"], ["image_file_name", "pillows.jpg"], ["updated_at", "2015-07-02 01:15:01.519234"], ["id", 2]]

  def destroy
    @listing.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 1]]

    def set_listing
      @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]